[
  {
    "ID": 1,
    "MusicAct": "ANNE-MARIE",
    "Day": 1,
    "Time": "14.00",
    "Stage": 3,
    "Info": "Anne-Marie’s rise to stardom has been nothing short of meteoric. A former 3 x world karate champion and West End child star turned multi-platinum-selling artist, Anne-Marie has gone onto become one of the world’s most-loved and successful pop stars of our times. Following a string of chart-busting singles over her career to date – from her Ed Sheeran co-write and UK Top 3 ‘2002’ to the garage-infused juggernaut and KSI collaboration ‘Don’t Play’ – Anne-Marie is an artist who wins on her playful commentary, magnetic vocals and infectious personality, as was perfectly showcased her 2016 debut and four million-selling, Speak Your Mind, which became that years’ biggest-selling debut release in the UK. Last year saw Anne-Marie make new strides, too. Making her prime time debut as a new judge on talent show The Voice this year – a show she won - Anne-Marie released her much-anticipated and critically acclaimed second studio album, ‘Therapy’. A title that holds an extremely important message to the Mind Charity ambassador, Anne-Marie has continually campaigned for the conversation surrounding mental health, be that in her YouTube documentary titled ‘How to be Anne-Marie’ or fronting ITV’s Britain Get Talking campaign. Anne-Marie also released her debut book, You Deserve Better; part memoir, part practical self-help, Anne-Marie drew on her own experiences to help readers tackle life’s challenges, embrace opportunities and celebrate their successes. Over her career to date, Anne-Marie has become a BRITs Critics Choice finalist; Nordoff Robbins ‘Best Newcomer’ winner; LGBT ‘Music Artist’ winner for 2021; 9 x BRIT Award nominee; an official ambassador of The Princes Trust and more.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Anne-Marie.jpg",
    "Favourite": true
  },
  {
    "ID": 2,
    "MusicAct": "BLONDIE",
    "Day": 1,
    "Time": "14:00",
    "Stage": 2,
    "Info": "Undeniably one of the most trailblazing and influential bands of our time, Blondie is pioneering frontwoman/songwriter Debbie Harry, guitarist/conceptual mastermind Chris Stein and powerhouse drummer Clem Burke, along with band mates bassist Glen Matlock, guitarist Tommy Kessler and keyboardist Matt Katz-Bohen. Among their hits is the groundbreaking rock-disco hybrid “Heart of Glass” the equally influential hip-hop fantasia “Rapture” the stalker-love song “One Way Or Another” and the lilting calypso “The Tide Is High.” It’s a thrilling journey back to when Blondie pushed punk onto the dance floor and introduced a wider audience to hip-hop sounds, all the while building a catalogue of enduring hits along the way. For the last four decades, Blondie has become and still remains a true global icon; one whose influence both shaped and continues to inform the worlds of music, fashion and art. From an irreverent Lower East Side punk outfit to bona fide international ambassadors of New York cool, Blondie will forever be synonymous with that punk spirit that lives somewhere in all of us. Their chart-topping success, fearless spirit and rare longevity led to an induction into the Rock ‘N’ Roll Hall of Fame in 2006 and more than 40 million albums sold worldwide to date. As we look back at the band’s storied career, it makes Blondie’s current vibrancy that much more stunning after 40 years of entertaining all of us.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Blondie.jpg",
    "Favourite": false
  },
  {
    "ID": 3,
    "MusicAct": "COURTEENERS",
    "Day": 2,
    "Time": "17:00",
    "Stage": 3,
    "Info": "Undeniably one of the most trailblazing and influential bands of our time, Blondie is pioneering frontwoman/songwriter Debbie Harry, guitarist/conceptual mastermind Chris Stein and powerhouse drummer Clem Burke, along with band mates bassist Glen Matlock, guitarist Tommy Kessler and keyboardist Matt Katz-Bohen. Among their hits is the groundbreaking rock-disco hybrid “Heart of Glass” the equally influential hip-hop fantasia “Rapture” the stalker-love song “One Way Or Another” and the lilting calypso “The Tide Is High.” It’s a thrilling journey back to when Blondie pushed punk onto the dance floor and introduced a wider audience to hip-hop sounds, all the while building a catalogue of enduring hits along the way. For the last four decades, Blondie has become and still remains a true global icon; one whose influence both shaped and continues to inform the worlds of music, fashion and art. From an irreverent Lower East Side punk outfit to bona fide international ambassadors of New York cool, Blondie will forever be synonymous with that punk spirit that lives somewhere in all of us. Their chart-topping success, fearless spirit and rare longevity led to an induction into the Rock ‘N’ Roll Hall of Fame in 2006 and more than 40 million albums sold worldwide to date. As we look back at the band’s storied career, it makes Blondie’s current vibrancy that much more stunning after 40 years of entertaining all of us.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Courteeners.jpg",
    "Favourite": false
  },
  {
    "ID": 4,
    "MusicAct": "ECHO & THE BUNNYMEN",
    "Day": 2,
    "Time": "19:00",
    "Stage": 1,
    "Info": "Bio Coming soon",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Echo-and-the-Bunnymen.jpg",
    "Favourite": false
  },
  {
    "ID": 5,
    "MusicAct": "ELLA HENDERSON",
    "Day": 1,
    "Time": "20:00",
    "Stage": 1,
    "Info": "Having burst on to the scene 10 years ago with a No. 1 debut single (‘Ghost’) and album (‘Chapter One’), Ella Henderson has since ascended to a multi-platinum selling, two-time BRIT Award nominee, with over a billion streams to her name - all by the age of 26. To date, Ella has achieved five UK Top 10s as a lead artist, the most recent being ‘Let’s Go Home Together’ with Tom Grennan – one of 2021’s biggest songs and an Ivor Novello nominee for Best Song Musically and Lyrically. Earlier this year, Ella released her long-awaited second album ‘Everything I Didn’t Say’. Heralded by powerful lead single ‘Brave’ and a showstopping performance on The Graham Norton Show, the record debuted in the Official Charts Top 10, becoming her second to do so. A hit songwriter and powerhouse vocalist, Ella has collaborated with musical luminaries including Ryan Tedder and Babyface, as well as superstar DJs including Sigma and Kygo. Currently featured on smashes from David Guetta (‘Crazy What Love Can Do’ with Becky Hill) and Nathan Dawe (’21 Reasons’), Ella looks set to soundtrack summer ‘22.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Ella-Henderson.jpg",
    "Favourite": false
  },
  {
    "ID": 6,
    "MusicAct": "EXAMPLE",
    "Day": 2,
    "Time": "14:30",
    "Stage": 3,
    "Info": "Crossover dance music icon Example is about to release his 8th studio album We May Grow Old But We Never Grow Up. Maintaining years of momentum with chart topping singles, career defining festival sets, sold out tours and multiple platinum records, the 8th album is set to embody his youthful nature whilst pushing a fresh range of rising talent across pop and dance spectrums. As an iconic figure, loving father, husband and artist, Example is the front man of multiple generations. Having spent well over a decade in the game, the UK mainstay has crafted a career drenched in accolades. Example’s 2022 began with a trip to the UK for his 14 date headline tour which sold over 25,000 tickets continuing his legacy whilst attracting new fans both young and old, adding to his ever growing loyal following cultivated throughout his prestigious career. While he was on the UK tour the second record from the new album, a collaboration with Kanine featuring vocals from Penny Ivy, was awarded BBC Radio 1’s prestigious Hottest Record In The World moniker. It was during the extensive jaunt across the country that Example connected with one of the hottest D&B producers of the moment, Bou. Fresh off the back of his breakout single Streetside with Bru-C, multiple Beatport #1’s and BBC Radio 1 support, Bou headed to Example’s sold out Academy show where they formed an instant bond, and the collaboration DEEP began to take shape.  Meanwhile Nonô, self-described as “made in Brazil and shipped to London”, was one of the supporting acts on Example’s UK tour, marking the perfect addition to DEEP with her flawless vocals and effervescent energy that has seen her work alongside Alok, Eden Prince and Parx. NME added her to the NME 100, a list of essential new artists set to take over 2022.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Example.jpg",
    "Favourite": false
  },
  {
    "ID": 7,
    "MusicAct": "GABRIELLE",
    "Day": 2,
    "Time": "16:00",
    "Stage": 2,
    "Info": "Bio Coming Soon",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Gabrielle.jpg",
    "Favourite": false
  },
  {
    "ID": 8,
    "MusicAct": "GANG OF YOUTHS",
    "Day": 1,
    "Time": "17:00",
    "Stage": 4,
    "Info": "Gang Of Youths were formed in Sydney, Australia in 2011 by Dave Le'aupepe and some like-minded mates. Within months of their first gig, they’d started to attract a rabid fanbase enraptured by their expansive, widescreen take on indie-rock, the sort of music that manages to feel universal and personal at the same time. They honed this sound over two records, on 2015’s The Positions and 2017’s Go Farther In Lightness, and won three of Australia’s prestigious ARIA Awards on the back of their Platinum-selling second album. Word spread further afield too, helped by an extensive support tour in the US and Europe supporting Mumford & Sons. They relocated to London towards the end of 2017, where they set up base together in a share-house in Angel, North London. In Feb 2022 the band released their third studio album titled angel in realtime. Inspired by the loss of frontman Dave Le’aupepe’s father, it’s a record which channels its emotional intensity and existential questions into an exploratory sonic tapestry that touches upon everything from Britpop and post-punk to American minimalism and contemporary classical. Self-produced and recorded in the bands own studio in Hackney, London, the record also pays tribute to Le’aupepe’s family heritage, with samples and original instrumentation from the Polynesian islands and the wider South Pacific. angel in realtime. debut at #1 on the Australian ARIA Charts, and #10 on the UK Album Charts and has been tipped as album of the year contenders by the likes of Triple J, UPROXX, Stereogum and more. Gang Of Youths is Dave Le’aupepe, Max Dunn, Jung Kim, Donnie Borzestowski and Tom Hobden.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Gang-of-Youths.jpg",
    "Favourite": false
  },
  {
    "ID": 9,
    "MusicAct": "GEORGE EZRA",
    "Day": 2,
    "Time": "12:00",
    "Stage": 1,
    "Info": "Including the hit singles ‘Anyone For You’ and ‘Green Green Grass,’ Gold Rush Kid is available now via Columbia Records to stream, download and buy. The album secured Ezra’s position as one of the most successful UK artists of the past decade. Hit single ‘Green Green Grass’ has spent 13 weeks in the UK Top 10, peaking at #3, and doesn’t show any signs of slowing down. Both singles from the album so far have topped the UK Airplay Chart and George is the only artist with 2 songs on the Top 10 most played at Radio 1 this year as well as being overall the most played artist across BBC stations. After two blockbuster albums – Wanted On Voyage (2014) and Staying At Tamara’s (2018), both of which reached number 1 in the UK and went 4x platinum in the UK, with over 8 million album equivalent sales globally and 7 billion career streams - the 6x platinum UK number 1 single ‘Shotgun’; and the 2019 Brit Award for British Male Solo Artist, it was time to return to heart and hearth, with an album written and produced entirely in London with longstanding collaborator Joel Pott. The resulting record is some of Ezra’s most personal and reflective work to date. Take ‘I Went Hunting’ for example – described by The Sunday Times as “the best thing he has done,” or ‘Love Somebody Else’ – “because I’m giving up on myself” – praised by the Guardian for its emotional lyricism and “stately and cinematic” atmospherics in their Album of the Week review.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-George-Ezra.jpg",
    "Favourite": true
  },
  {
    "ID": 10,
    "MusicAct": "GROOVE ARMADA",
    "Day": 2,
    "Time": "19:00",
    "Stage": 3,
    "Info": "In 2022 it will be 25 years since Groove Armada debuted, going on to become one of the most successful dance acts of the time, and maintaining their position as an influential force ever since. Over two decades of prolific productions and tireless touring they’ve proved that it’s possible to daringly explore a multitude of sounds while achieving critical and commercial success. From the dancehall dub of ‘Superstylin’’ to the crossover pop appeal of ‘Song 4 Mutya (Out of Control)’ and from the dancefloor-igniting ‘I See You Baby’ to the woozy sunset vibes of ‘At The River’, Groove Armada have consistently and uncompromisingly followed their own vision. Each one of those cuts stands alone as a certified classic, revered in the dance music hall of fame for their timeless appeal. Now the stage is set for an almighty celebration as Groove Armada approach a huge milestone and prepare to mark the anniversary with a return to the road, and plenty of music. Over 25 years the duo have done it all, from huge outdoor performances to intimate parties, traveling the world, delivering their diverse dance floor-focused sound to raucous crowds on every continent. Despite their extensive list of achievements, there’s still plenty of motivation to have another huge party and go the extra mile to make GA25 one to remember, for fans new and old. The duo - Tom Findlay and Andy Cato - first met in London back in the nineties and their combined talent took them to the highest of heights: three UK Top 10 albums; three Grammy nominations; a BRIT nomination; and a succession of hit singles that are still being discovered by new fans to this day. Despite having formed a quarter-of-a-century before streaming exploded, they still command the attention of over 2.3million monthly listeners on Spotify, demonstrating their cross-generational appeal. They’ve also collaborated with or remixed countless high-profile artists, notably Madonna, Paul Simon, Fatboy Slim, Calvin Harris, Neneh Cherry and Bryan Ferry.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Groove-Armada.jpg",
    "Favourite": false
  },
  {
    "ID": 11,
    "MusicAct": "JAMES BAY",
    "Day": 1,
    "Time": "13:00",
    "Stage": 3,
    "Info": "Within a short six years since his debut, we’ve already seen many sides of James Bay…There was the GRAMMY® Award-nominated troubadour with dusty acoustic anthems of heartbreak on 2014’s Chaos and the Calm. This evolved into losing the hat and leaning into a much louder sound for 2018’s Electric Light and finally mixing the two sounds together on 2019’s Oh My Messy Mind EP. All three of these chapters are a proud part of James Bay, but in 2020, he’s ready to tell a whole new story… “I’m a really private person,” he admits. “My home life is a very intimate thing for me. However, I’m ready to talk about it for the first time. These next singles and album are a bit of a tribute to the thirteen-year journey my girlfriend and I have been on. She’s the coolest person in the world. We were close friends before we were in a relationship. Back in the day, we would be sitting in on a Wednesday night watching TV, and she would say, ‘Hang on, if you want to be a big artist one day, surely you should be out in some pub or club playing some songs right now!’ She instilled that in me, and I got out and did it. I wouldn’t be here without her. She’s the fire in the engine tank.” Honoring the person responsible for igniting this fire (and kickstarting his career), James decided to write about his personal life like never before and asked himself one question while diving into this new body of work…",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-James-Bay.jpg",
    "Favourite": false
  },
  {
    "ID": 12,
    "MusicAct": "MANIC STREET PREACHERS",
    "Day": 2,
    "Time": "12:00",
    "Stage": 1,
    "Info": "Manic Street Preachers are one of the most influential and iconic rock bands to have come out of Wales. Formed in Blackwood in 1986 they have gone on to release 14 studio albums and have headlined countless festivals including Glastonbury, T in the Park, V Festival and Reading & Leeds. They have won eleven NME Awards, eight Q Awards and four BRIT Awards and were also nominated for the Mercury Prize and the MTV Europe Music Awards. Their first album ‘Generation Terrorists’ released in February 1992 was a hugely ambitious debut, establishing them as unique artists, combining classic rock riffs with the attitude of pop and punk and lyrically setting themselves head and shoulders above their contemporaries. Throughout the years they have collected fans from all over the world, maturing and changing musically whilst always keeping the classic Manics sound. At their live shows early tracks such as ‘You Love Us’ and ‘Motorcycle Emptiness’ comfortably sit alongside huge chart hits such as the No. 1 single ‘If You Tolerate This Your Children Will Be Next’; other singles ‘You Stole The Sun From My Heart’, 'You Stole The Sun From My Heart' and ‘Design For Life’ mosh alongside newer songs such as ‘Orwellian’ and ‘The Secret He Had Missed', both taken from their most recent album 'The Ultra Vivid Lament' which reached No. 1 in the UK Album Charts in September 2021.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Manic-Street-Preachers.jpg",
    "Favourite": false
  },
  {
    "ID": 13,
    "MusicAct": "MIKA",
    "Day": 1,
    "Time": "14:00",
    "Stage": 3,
    "Info": "International pop sensation MIKA has built an unshakable career and catalogue crafting a world of gritty romance amidst the joy and playfulness of technicolored alternative pop. He’s a renaissance artist of impeccable intention who’s name has rightfully found its way alongside legendary acts such as Elton John, Freddie Mercury and Prince, and is best known for his shimmering mega-hit “Grace Kelly.” Born Michael Holbrook Penniman Jr. in 1983 in Beirut, MIKA and his family moved to Paris before settling in London where he began opera and piano lessons at age 8. He showed otherworldly vocal range quickly becoming a young virtuoso of the piano and songwriting. Starting with his 2007 debut album Life In Cartoon Motion featuring “Grace Kelly,” MIKA has sold over 10 million records, and is a certified Gold and Platinum artist in 32 countries worldwide. He is Grammy nominated, won a Brit Award and went on to release three additional platinum selling albums The Boy Who Knew Too Much, The Origin of Love, and No Place In Heaven. He now presents his fifth studio album My Name Is Michael Holbrook. “I wanted to find out where I came from and why my legal name is Michael Penniman Holbrook Junior,” says MIKA. “I had the title of the album before I had the album. It was a manifesto. It was a challenge for me.” Seeking to uncover the identity of MIKA before “Grace Kelly,” he found a profound sense of joy at his discovery. “It was quite liberating. I freed myself of the idea of MIKA.”",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Mika.jpg",
    "Favourite": false
  },
  {
    "ID": 14,
    "MusicAct": "N-DUBZ",
    "Day": 2,
    "Time": "19:00",
    "Stage": 1,
    "Info": "Bio Coming Soon",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-N-Dubz.jpg",
    "Favourite": false
  },
  {
    "ID": 15,
    "MusicAct": "NIALL HORAN",
    "Day": 2,
    "Time": "13:00",
    "Stage": 2,
    "Info": "Singer, songwriter, and multi-instrumentalist Niall Horan has taken the world by storm. A former member of One Direction, known as one of the best-selling boy bands of all time, he has toured the world and played to millions of fans in sold-out stadiums worldwide, including Wembley Arena. Niall is a storyteller at heart. His two solo albums Heartbreak Weather and 2017’s Flicker, released on Capitol Records, were critically acclaimed. The latter debuted at No. 1 on the Billboard 200 in the US and produced the hit singles “This Town” and “Slow Hands.” Niall’s emotive voice is rich and insightful, as he effortlessly captures his real-life experiences and range of emotions. The result is a whirlwind of modern pop and nostalgic grooves. As fans are eagerly awaiting his next solo project, Niall has also just been announced as the newest coach for next season of The Voice USA.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Niall-Horan.jpg",
    "Favourite": false
  },
  {
    "ID": 16,
    "MusicAct": "ROBBIE WILLIAMS",
    "Day": 2,
    "Time": "20:00",
    "Stage": 1,
    "Info": "The September 2022 release of the album XXV marks the fact – remarkable, improbable, indisputable – that it is now over twenty-five years since Robbie Williams tumbled out of the boy band Take That into a solo career that no one, not even him, could yet quite imagine. What has happened since then…well, part of the story can be told through the swagger of sales and statistics: over 85 million albums sold around the world; thirteen UK number one albums (the most for any solo artist, equalled only by Elvis Presley); fourteen number one singles; the most concert tickets sold in a day (1.6 million on November 19, 2005); the record-breaking three nights at Knebworth to 375,000 people in 2003; the parallel grand successes of his swing albums and of a reconvened Take That (upon release in 2010, the Progress album became the fastest selling album of the twenty-first century, and the subsequent tour was the biggest-selling British tour ever); an unprecedented and unmatched 18 Brit awards; the Christmas album, the X-Factor judging, the Royal Shakespeare Company musical The Boy In The Dress, Soccer Aid, numerous collaborations in music, art, radio, books, fashion, TV and film, and on and on and on… But that’s only a small part of the whole wild journey, one on which XXV offers a fresh and illuminating perspective. Here are songs from across these twenty-five years – the oldest, “Angels”, emerging from only his second writing session with Guy Chambers at Chambers’ North London flat; the newest, “Lost”, emerging unexpectedly out of the ether one evening in Wiltshire last November. Aside from the most recent of them, these are songs that are now being revisited. Or, as Robbie might more precisely phrase it, “re-worked, re-imagined, and re-loved.”",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Robbie-Williams.jpg",
    "Favourite": false
  },
  {
    "ID": 17,
    "MusicAct": "SAM RYDER",
    "Day": 2,
    "Time": "18:00",
    "Stage": 4,
    "Info": "In 2020, as the world went into lockdown, Sam Ryder uploaded the first of his now infamous covers. They quickly caught the attention of some famous fans (think Justin Bieber, Sia, Alicia Keys and Elton John) – with compilations of his videos appearing on The Ellen Show, BBC’s Newsbeat and more. As the videos kept coming, so did the fans – with his socials standing at over 10 million followers to date and hundreds of thousands of comments. Fast forward a year and Sam Ryder stands with 17M social followers and is in the running to be crowned as Tik Tok’s most popular UK artist account for the second year in a row. This would be no mean feat should it happen, especially with Ed Sheeran in full campaign mode and a favourite to take this crown. So what has changed for Sam Ryder in 2021 ? Quite a lot as it happens…. A 5 song EP ‘The Sun’s Gonna Rise’ rolled out a track at a time, amassing some 45 million streams globally. First up was Whirlwind’ – how else could you begin to describe the journey that Sam has been on over the past year? He has spent much of his adult life touring, writing and performing in bands, lived in Hawaii for a while and even owned a vegan coffee shop before closing it down and deciding the time was right to pursue his dream of becoming a solo artist. The culmination of the EP campaign was the release of More, a song that touched the hearts of almost all who heard it. With the powerful chorus stating “All anyone wants is more time, more life, more healing” fans were often able to connect that sentiment to their own lives with 1,000s of stories emerging on line of a song that comforted those who were sick, had relatives who were unwell or who were simply sick of being separated from their loved ones.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Sam-Ryder.jpg",
    "Favourite": true
  },
  {
    "ID": 18,
    "MusicAct": "SOPHIE ELLIS-BEXTOR",
    "Day": 2,
    "Time": "14:00",
    "Stage": 2,
    "Info": "Sophie Ellis-Bextor shot to fame as a vocalist on Spiller's huge number one single, ‘Groovejet’ and her worldwide smash hit, ‘Murder on the Dancefloor’. Her debut solo album, ‘Read My Lips’, was released in 2001 and sold more than 2 million copies worldwide. Her subsequent album releases include ‘Shoot from the Hip’ (2003), ‘Trip the Light Fantastic’ (2007) and ‘Make a Scene’ (2011). In 2014, Sophie released her album ‘Wanderlust’ on her own label EBGB’s, which was co-written and produced by Ed Harcourt. It proved to be a critical and commercial success spending 3 weeks in the UK top 10 and selling over 100,000 copies. Sophie followed this release and collaboration with 2016's ‘Familia’, which saw her return to the dancefloor with her single ‘Come With Us’. In January of 2019, with Ed Harcourt as Producer and Amy Langley (of Dirty Pretty Strings) arranging, Sophie released orchestrated versions of all her hits and past single releases with her orchestral greatest hits album ‘The Song Diaries’. In 2020, her Kitchen Discos, performed at home during lockdown with her five sons and recorded by her husband, musician Richard Jones, were watched and enjoyed by 40 million around the world. Following the performances, she released her latest album ‘Songs From The Kitchen Disco’ in late 2020 on Cooking Vinyl, bringing together Sophie’s hits with many other songs from her phenomenally successful lockdown Kitchen Disco performances, garnering further critical acclaim and yet another top 10 UK album chart position.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Sophie-Ellis-Bextor.jpg",
    "Favourite": true
  },
  {
    "ID": 19,
    "MusicAct": "SUGABABES",
    "Day": 2,
    "Time": "19:00",
    "Stage": 2,
    "Info": "Sugababes became the most successful British girlbands of the 21st century with six Number One singles, millions of global sales and multiple multi-platinum albums. Along the way they told one of the most spectacular stories of the modern pop era, but it all started in the summer of 2000 with one song, three voices and a mysterious white label 7”. “The first time Overload was played on the radio they announced it as Sugababes, but they didn’t know anything else about us,” remembers Siobhan Donaghy. “They had no idea who was in the band, what we looked like, how old we were. Nothing. It was a mystery: who are these girls?” Those girls were north-Londoners Siobhan Donaghy (then 16), Mutya Buena and Keisha Buchanan (both 15) and for the last year and a half they’d been working on One Touch, an album whose nonchalant magnetism dragged pop music into the 21st century. It bewitched critics everywhere from Smash Hits and TOTP to the NME and The Face, with the Independent praising its ability to “skip playfully between upbeat R&B, poppy soul and groove-laden ballads” and the Guardian, making it album of the week, noting “One Touch is all about experiencing the pain of growing up while retaining that invincible teenage glow”.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Sugababes.jpg",
    "Favourite": false
  },
  {
    "ID": 20,
    "MusicAct": "THE CHEMICAL BROTHERS",
    "Day": 2,
    "Time": "18:00",
    "Stage": 1,
    "Info": "“There is no greater live dance act in the world right now” – NME Over the past three decades, The Chemical Brothers have grown from a hugely respected underground electronic act into one of the most renowned and in-demand live acts in the world. Their mind-bending, fully immersive audio-visual live show has headlined festivals in every corner of the globe and earned accolades all over, with NME stating “there is no greater live dance act in the world right now”. The band's huge catalogue of anthems - including tracks like ‘Galvanize’, 'Block Rockin' Beats', ‘Got To Keep On’ and ‘Hey Boy Hey Girl’ has won the band multiple Grammy and Brit Awards and over 13 million album sales worldwide, including 5 UK number ones.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Chemical-Brothers.jpg",
    "Favourite": true
  },
  {
    "ID": 21,
    "MusicAct": "THE HUMAN LEAGUE",
    "Day": 1,
    "Time": "13:00",
    "Stage": 4,
    "Info": "When you’re in love, you know you’re in love. In my case, it was Thursday 30th April 1981. I was a bored 13 year old, watching *Top Of The Pops* with disinterest, when my attention was annexed by a man with a hairstyle like a half-drawn curtain, two girls next door, well they were if you lived on the coolest street in Britain, and two guys standing sullenly behind synthesizers. In the background two audacious reel-to-reel tape machines whirred provocatively away producing a brutal, pounding robo-beat, throw in some intriguingly encoded lyrics, “Put your hand in a party wave, pass around/Make a shroud pulling combs through a backwash frame...” and The Human League were my new obsession. The old posters were torn down. The League posters went up. If you were older and/or more clued in to the musical avant-garde, you already knew all about The Human League. For my generation, they were the fresh sound of a new decade. Eagerly, you re-investigated their enigmatic past... Now, the history books will invariably tell you that The Human League’s career is the tale of two pop groups but, if you listen to their two pre-fame albums, *Reproduction* (1979) and *Travelogue* (1980), for all the esoteric songs about the karmic damage caused by the farming of silkworms, “Being Boiled” written during Phil Oakey’s six months as a vegetarian, arch satires on indie snobbery, or bizarre tales about a love affair between a crow and a baby, the same threads were there.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-Human-League.jpg",
    "Favourite": true
  },
  {
    "ID": 22,
    "MusicAct": "THE REYTONS",
    "Day": 1,
    "Time": "12:00",
    "Stage": 4,
    "Info": "The Reytons have quickly risen from hometown heroes in South Yorkshire to a nationally renowned indie-rock outfit. A word of mouth sensation, the band sold out every single date on their 2022 ‘Uninvited Tour’, with over 17,000 fans channelling football-like tribalism aided by war chants and flares. This comes just months after selling out Rotherham's 4,500 strong Magna in only 10 hours. The Reytons head into 2023 with a new album on the horizon in ‘What’s Rock And Roll?’, all eyes focussed on hitting the number one chart position and bettering the 11th place finish of their debut ‘Kids Off The Estate’. Setting The Reytons apart from the competition is their fiercely independent approach to the way they work. Not exactly welcomed with open arms by the industry from the very start, the band channel their working class grit and determination to overcome every obstacle thrown at them. Aided by the masses of loyal fans, no achievement is out of reach. No Label. No Backing. All Reytons.",
    "Image": "https://isleofwightfestival.com/assets/images/bands/IWFest23-The-Reytons.jpg",
    "Favourite": false
  }
]